jonacappelle/nRF52-DCU/BLE_Services/ble_imu_service_c.c
    NRF_LOG_DEBUG("ble_imu_service_on_db_disc_evt");

    // Check if the Led Button Service was discovered.
    if (p_evt->evt_type == BLE_DB_DISCOVERY_COMPLETE &&
        p_evt->params.discovered_db.srv_uuid.uuid == IMU_SERVICE_UUID_SERVICE &&
        p_evt->params.discovered_db.srv_uuid.type == p_ble_imu_service_c->uuid_type)
    {
        ble_imu_service_c_evt_t evt;
        evt.evt_type    = BLE_IMU_SERVICE_C_EVT_DISCOVERY_COMPLETE;
        evt.conn_handle = p_evt->conn_handle;
        NRF_LOG_DEBUG("tes discover count : %d", p_evt->params.discovered_db.char_count);
        for (uint32_t i = 0; i < p_evt->params.discovered_db.char_count; i++)
        {
            const ble_gatt_db_char_t * p_char = &(p_evt->params.discovered_db.charateristics[i]);
            // NRF_LOG_INFO("<i=%d> UUID : %x", i, p_char->characteristic.uuid.uuid);
            switch (p_char->characteristic.uuid.uuid)
            {
                case IMU_SERVICE_UUID_CONFIG_CHAR:
                    evt.params.peer_db.config_cccd_handle      = p_char->cccd_handle;
                    evt.params.peer_db.config_handle = p_char->characteristic.handle_value;
                    // NRF_LOG_INFO("401 evt CONFIG handle = %d", p_char->characteristic.handle_value);
                    break;                    
                case IMU_SERVICE_UUID_ADC_CHAR: 
                    evt.params.peer_db.adc_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.adc_handle = p_char->characteristic.handle_value;
                    // NRF_LOG_INFO("403 evt ADC handle = %d", evt.params.peer_db.adc_handle);
                    break;
                case IMU_SERVICE_UUID_QUATERNION_CHAR:
                    evt.params.peer_db.quat_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.quat_handle = p_char->characteristic.handle_value;
                    // NRF_LOG_INFO("404 evt Quaternion handle = %d", evt.params.peer_db.quat_handle);
                    break;
                case IMU_SERVICE_UUID_INFO_CHAR:
                    evt.params.peer_db.info_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.info_handle = p_char->characteristic.handle_value;
                    // NRF_LOG_INFO("404 evt Info handle = %d", evt.params.peer_db.info_handle);
                    break;
                case IMU_SERVICE_UUID_RAW_CHAR:
                    evt.params.peer_db.raw_cccd_handle      = p_char->cccd_handle;
                    evt.params.peer_db.raw_handle = p_char->characteristic.handle_value;
                    // NRF_LOG_INFO("406 evt raw data handle = %d", evt.params.peer_db.raw_handle);
                    break;
                case IMU_SERVICE_UUID_EULER_CHAR: 
                    evt.params.peer_db.euler_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.euler_handle = p_char->characteristic.handle_value;
                    // NRF_LOG_INFO("407 evt euler handle = %d", evt.params.peer_db.euler_handle);
                    break;
                default:
                    break;
            }
        }
        //If the instance has been assigned prior to db_discovery, assign the db_handles
         if (p_ble_imu_service_c->conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            NRF_LOG_INFO("IMU_SERVICE instance has been initialized prior");
            if (
                (p_ble_imu_service_c->peer_imu_service_db.config_cccd_handle    = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.config_handle         = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.euler_cccd_handle    = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.euler_handle         = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.quat_cccd_handle     = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.quat_handle          = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.info_cccd_handle     = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.info_handle          = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.raw_cccd_handle      = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.raw_handle           = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.adc_cccd_handle   = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_imu_service_c->peer_imu_service_db.adc_handle        = BLE_GATT_HANDLE_INVALID))
            {
                p_ble_imu_service_c->peer_imu_service_db = evt.params.peer_db;
            }
        }
        p_ble_imu_service_c->evt_handler(p_ble_imu_service_c, &evt);

    }
    else if(p_evt->evt_type != BLE_DB_DISCOVERY_COMPLETE)
    {
        NRF_LOG_DEBUG("Ble service discovery not complete");

        ble_imu_service_c_evt_t evt;
        evt.evt_type    = 0;
        p_ble_imu_service_c->evt_handler(p_ble_imu_service_c, &evt);
    }
}


uint32_t ble_imu_service_c_init(ble_imu_service_c_t * p_ble_imu_service_c, ble_imu_service_c_init_t * p_ble_imu_service_c_init)
{
    uint32_t      err_code;
    ble_uuid_t    imu_service_uuid;
    ble_uuid128_t imu_service_base_uuid = {MOTION_SERVICE_UUID_BASE};

    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c_init);
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c_init->evt_handler);

    p_ble_imu_service_c->peer_imu_service_db.config_cccd_handle      = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.config_handle           = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.euler_cccd_handle      = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.euler_handle           = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.adc_cccd_handle     = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.adc_handle          = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.quat_cccd_handle       = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.quat_handle            = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.info_cccd_handle       = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.info_handle            = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.raw_cccd_handle        = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.raw_handle             = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->conn_handle                    = BLE_CONN_HANDLE_INVALID;
    p_ble_imu_service_c->evt_handler                    = p_ble_imu_service_c_init->evt_handler;
    p_ble_imu_service_c->p_gatt_queue               = p_ble_imu_service_c_init->p_gatt_queue;

