jonacappelle/nRF52-DCU/BLE_Services/ble_imu_service_c.c
    err_code = sd_ble_uuid_vs_add(&imu_service_base_uuid, &p_ble_imu_service_c->uuid_type);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    VERIFY_SUCCESS(err_code);

    imu_service_uuid.type = p_ble_imu_service_c->uuid_type;
    imu_service_uuid.uuid = IMU_SERVICE_UUID_SERVICE;
    return ble_db_discovery_evt_register(&imu_service_uuid);
}

void ble_imu_service_c_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{

    // NRF_LOG_DEBUG("ble_imu_service_c_on_ble_evt");

    if ((p_context == NULL) || (p_ble_evt == NULL))
    {
        return;
    }

    ble_imu_service_c_t * p_ble_imu_service_c = (ble_imu_service_c_t *)p_context;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GATTC_EVT_HVX:
            on_hvx(p_ble_imu_service_c, p_ble_evt);
            break;

        case BLE_GATTC_EVT_WRITE_RSP:
            // on_write_rsp(p_ble_imu_service_c, p_ble_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            on_disconnected(p_ble_imu_service_c, p_ble_evt);
            break;

        default:
            break;
    }
}


/**@brief Function for configuring the CCCD.
 *
 * @param[in] conn_handle The connection handle on which to configure the CCCD.
 * @param[in] handle_cccd The handle of the CCCD to be configured.
 * @param[in] enable      Whether to enable or disable the CCCD.
 *
 * @return NRF_SUCCESS if the CCCD configure was successfully sent to the peer.
 */
static uint32_t cccd_configure_tes(ble_imu_service_c_t * p_ble_imu_service_c, uint16_t conn_handle, uint16_t handle_cccd, bool enable)
{
    // NRF_LOG_DEBUG("Configuring CCCD. CCCD Handle = %d, Connection Handle = %d",
    //     handle_cccd,conn_handle);

    // tx_message_t * p_msg;
    // uint16_t       cccd_val = enable ? BLE_GATT_HVX_NOTIFICATION : 0;
    
    // p_msg              = &m_tx_buffer[m_tx_insert_index++];
    // m_tx_insert_index &= TX_BUFFER_MASK;

    // p_msg->req.write_req.gattc_params.handle   = handle_cccd;
    // p_msg->req.write_req.gattc_params.len      = WRITE_MESSAGE_LENGTH;
    // p_msg->req.write_req.gattc_params.p_value  = p_msg->req.write_req.gattc_value;
    // p_msg->req.write_req.gattc_params.offset   = 0;
    // p_msg->req.write_req.gattc_params.write_op = BLE_GATT_OP_WRITE_REQ;
    // p_msg->req.write_req.gattc_value[0]        = LSB_16(cccd_val);
    // p_msg->req.write_req.gattc_value[1]        = MSB_16(cccd_val);
    // p_msg->conn_handle                         = conn_handle;
    // p_msg->type                                = WRITE_REQ;

    // tx_buffer_process();
    // return NRF_SUCCESS;

///////////

    NRF_LOG_DEBUG("Configuring CCCD. CCCD Handle = %d, Connection Handle = %d", handle_cccd, conn_handle);

    nrf_ble_gq_req_t tes_c_req;
    uint8_t          cccd[BLE_CCCD_VALUE_LEN];
    uint16_t         cccd_val = enable ? BLE_GATT_HVX_NOTIFICATION : 0;

    cccd[0] = LSB_16(cccd_val);
    cccd[1] = MSB_16(cccd_val);

    memset(&tes_c_req, 0, sizeof(tes_c_req));
 
    tes_c_req.type                        = NRF_BLE_GQ_REQ_GATTC_WRITE;
    tes_c_req.error_handler.cb            = gatt_error_handler;
    tes_c_req.error_handler.p_ctx         = p_ble_imu_service_c;
    tes_c_req.params.gattc_write.handle   = handle_cccd;
    tes_c_req.params.gattc_write.len      = BLE_CCCD_VALUE_LEN;
    tes_c_req.params.gattc_write.p_value  = cccd;
    tes_c_req.params.gattc_write.offset   = 0;
    tes_c_req.params.gattc_write.write_op = BLE_GATT_OP_WRITE_REQ;

    return nrf_ble_gq_item_add(p_ble_imu_service_c->p_gatt_queue, &tes_c_req, conn_handle);
}


uint32_t ble_imu_service_c_quaternion_notif_enable(ble_imu_service_c_t * p_ble_imu_service_c)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    if (p_ble_imu_service_c->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    return cccd_configure_tes(p_ble_imu_service_c, p_ble_imu_service_c->conn_handle,
                          p_ble_imu_service_c->peer_imu_service_db.quat_cccd_handle,
                          true);
}

uint32_t ble_imu_service_c_info_notif_enable(ble_imu_service_c_t * p_ble_imu_service_c)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    if (p_ble_imu_service_c->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    return cccd_configure_tes(p_ble_imu_service_c, p_ble_imu_service_c->conn_handle,
                          p_ble_imu_service_c->peer_imu_service_db.info_cccd_handle,
                          true);
}

uint32_t ble_imu_service_c_adc_notif_enable(ble_imu_service_c_t * p_ble_imu_service_c)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    if (p_ble_imu_service_c->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    return cccd_configure_tes(p_ble_imu_service_c, p_ble_imu_service_c->conn_handle,
                          p_ble_imu_service_c->peer_imu_service_db.adc_cccd_handle,
                          true);
}

uint32_t ble_imu_service_c_euler_notif_enable(ble_imu_service_c_t * p_ble_imu_service_c)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    if (p_ble_imu_service_c->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    return cccd_configure_tes(p_ble_imu_service_c, p_ble_imu_service_c->conn_handle,
                          p_ble_imu_service_c->peer_imu_service_db.euler_cccd_handle,
                          true);
}

uint32_t ble_imu_service_c_raw_notif_enable(ble_imu_service_c_t * p_ble_imu_service_c)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    if (p_ble_imu_service_c->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    return cccd_configure_tes(p_ble_imu_service_c, p_ble_imu_service_c->conn_handle,
                          p_ble_imu_service_c->peer_imu_service_db.raw_cccd_handle,
                          true);
}

uint32_t ble_imu_service_config_set(ble_imu_service_c_t * p_imu_service, ble_imu_service_config_t * p_data)
{
    uint16_t length = sizeof(ble_imu_service_config_t);

    VERIFY_PARAM_NOT_NULL(p_imu_service);

    if ((p_imu_service->conn_handle == BLE_CONN_HANDLE_INVALID))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    NRF_LOG_INFO("Send config: conn_handle: %d", p_imu_service->conn_handle)

    if (length > BLE_IMU_SERVICE_MAX_DATA_LEN)
    {
        NRF_LOG_WARNING("Content too long.");
        return NRF_ERROR_INVALID_PARAM;
    }

