jonacappelle/nRF52-DCU/BLE_Services/ble_imu_service_c.c
    nrf_ble_gq_req_t write_req;

    memset(&write_req, 0, sizeof(nrf_ble_gq_req_t));

    write_req.type                        = NRF_BLE_GQ_REQ_GATTC_WRITE;
    write_req.error_handler.cb            = gatt_error_handler;
    write_req.error_handler.p_ctx         = p_imu_service;
    write_req.params.gattc_write.handle   = p_imu_service->peer_imu_service_db.config_handle;
    write_req.params.gattc_write.len      = length;
    write_req.params.gattc_write.offset   = 0;
    write_req.params.gattc_write.p_value  = (uint8_t *)p_data;
    write_req.params.gattc_write.write_op = BLE_GATT_OP_WRITE_REQ;
    write_req.params.gattc_write.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;

    ret_code_t err_code;
    err_code =  nrf_ble_gq_item_add(p_imu_service->p_gatt_queue, &write_req, p_imu_service->conn_handle);
    return err_code;
}

uint32_t ble_imu_service_c_handles_assign(ble_imu_service_c_t    * p_ble_imu_service_c,
                                  uint16_t         conn_handle,
                                  const imu_service_db_t * p_peer_handles)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    p_ble_imu_service_c->conn_handle = conn_handle;
    if (p_peer_handles != NULL)
    {
        p_ble_imu_service_c->peer_imu_service_db = *p_peer_handles;
    }

    NRF_LOG_INFO("conn_handle assign: %d", p_ble_imu_service_c->conn_handle);

    // return NRF_SUCCESS;

    return nrf_ble_gq_conn_handle_register(p_ble_imu_service_c->p_gatt_queue, conn_handle);
}

// #endif // NRF_MODULE_ENABLED(BLE_IMU_SERVICE_C)
